proyecto_bys_cardozo/app/Controllers/AuthController.php

SELECT *
FROM `persona`
WHERE `correoPersona` = 'paz250804@gmail.com'
AND `idEstado` = 1
 LIMIT 1
---
    private function verificarCredenciales(string $correo, string $password): ?array
    {
        $userModel = new persona_model();
        $user = $userModel->where('correoPersona', $correo)
                          ->where('idEstado', 1)
                          ->first();