proyecto_bys_cardozo/app/Controllers/CarritoController.php

    public function ver_carrito(): string|RedirectResponse {
        if (!session('login')) {
            return redirect()->to(base_url('login'))->with('error_login', 'Debes iniciar sesión para ver tu carrito.');
        }

        $cart = \Config\Services::cart();
        $data['items'] = $cart->contents();
        $data['formasPago'] = $this->formaPagoModel->findAll();
        $data['provincias'] = $this->provinciaModel->orderBy('nombreProvincia', 'ASC')->findAll();
        $data['localidades'] = $this->localidadModel->orderBy('nombreLocalidad', 'ASC')->findAll();
        $data['titulo'] = 'Carrito de compras';

        // Pre-carga estructurada de datos del cliente y su dirección
        $data['persona'] = null;
        $data['direccion'] = null;
        $data['idProvinciaCliente'] = null;
        $data['idLocalidadCliente'] = null;

        if (session('id')) {
            $data['persona'] = $this->personaModel->find(session('id'));
            if ($data['persona'] && !empty($data['persona']['idDireccion'])) {
                $direccion = $this->direccionModel->find($data['persona']['idDireccion']);
                if ($direccion) {
                    $data['direccion'] = $direccion;
                    $data['idLocalidadCliente'] = $direccion['idLocalidad'];
                    if ($loc = $this->localidadModel->find($direccion['idLocalidad'])) {
---
SELECT *
FROM `formapago`
SELECT *
FROM `provincias`
ORDER BY `nombreProvincia` ASC
SELECT *
FROM `localidades`
ORDER BY `nombreLocalidad` ASC
SELECT *
FROM `direccion`
WHERE `direccion`.`idDireccion` = '2'
SELECT *
FROM `localidades`
WHERE `localidades`.`idLocalidad` = '62'