proyecto_bys_cardozo/app/Controllers/CarritoController.php

SELECT *
FROM `formapago`
SELECT *
FROM `persona`
WHERE `idPersona` = '15'
 LIMIT 1
---
    public function ver_carrito(){
        $cart = \Config\Services::cart();
        $formaPagoModel = new formapago_model();
        $personaModel = new persona_model();

        $formasPago = $formaPagoModel->findAll();
        $data['items'] = $cart->contents();

        // Obtener datos de la persona para precargar el modal
        $data['persona'] = null;
        if (session('id')) {
            $data['persona'] = $personaModel->where('idPersona', session('id'))->first();