proyecto_bys_cardozo/app/Controllers/ConsultaController.php

SELECT `consultas`.*, CONCAT(persona.nombrePersona, " ", persona.apellidoPersona) AS nombreApellido, `persona`.`correoPersona` AS `correo`, CONCAT(admin.nombrePersona, " ", admin.apellidoPersona) AS adminNombreApellido
FROM `consultas`
JOIN `persona` ON `persona`.`idPersona` = `consultas`.`idPersona`
LEFT JOIN `persona` AS `admin` ON `admin`.`idPersona` = `consultas`.`idAdminResponde`
ORDER BY `consultas`.`respondido` ASC, CASE WHEN consultas.respondido = 0 THEN consultas.created_at END ASC, CASE WHEN consultas.respondido = 1 THEN consultas.created_at END DESC
---
    private function getConsultasConPersona(): array
    {
        return $this->consultaModel->select('consultas.*, CONCAT(persona.nombrePersona, " ", persona.apellidoPersona) AS nombreApellido, persona.correoPersona AS correo, CONCAT(admin.nombrePersona, " ", admin.apellidoPersona) AS adminNombreApellido')
                    ->join('persona', 'persona.idPersona = consultas.idPersona')
                    ->join('persona AS admin', 'admin.idPersona = consultas.idAdminResponde', 'left')
                    ->orderBy('consultas.respondido', 'ASC')
                    ->orderBy('CASE WHEN consultas.respondido = 0 THEN consultas.created_at END', 'ASC', false)
                    ->orderBy('CASE WHEN consultas.respondido = 1 THEN consultas.created_at END', 'DESC', false)
                    ->findAll();