proyecto_bys_cardozo/app/Controllers/LibroController.php

SELECT *
FROM `categorias`
SELECT *
FROM `autores`
SELECT *
FROM `etiqueta`
---
    private function cargarDatosFormulario($titulo) {
        $categoria = new categorias_model();
        $autor = new autores_model();
        $etiquetas = new etiqueta_model();

        return [
            'categorias' => $categoria->findAll(),
            'autores'    => $autor->findAll(),
            'etiquetas'  => $etiquetas->findAll(),
            'titulo'     => $titulo
        ];