proyecto_bys_cardozo/app/Controllers/LibroController.php

    public function form_agregar_libro() {
        $categoria = new categorias_model();
        $autor = new autores_model();
        $data['categorias'] = $categoria->findAll();
        $data['autores'] = $autor->findAll();
---
SELECT *
FROM `categorias`
SELECT *
FROM `autores`

    function gestionar_libros() {
        $libro_Model = new libros_model();
        $categoria = new categorias_model();
        $etiquetas = new etiqueta_model();
        $autor = new autores_model();

        $data['categorias'] = $categoria->findAll();
        $data['etiquetas'] = $etiquetas->findAll();
        $data['autores'] = $autor->findAll();

        $data['libro'] = $libro_Model->select('libros.*, categorias.nombreCategoria, etiqueta.nombre as nombreEtiqueta,
        autores.nombreAutor')
            ->join('categorias', 'categorias.idCategoria = libros.idCategoria')
            ->join('etiqueta', 'etiqueta.idEtiqueta = libros.etiquetaLibro')
            ->join('autores', 'autores.idAutor = libros.idAutor')
            ->findAll();
---
SELECT *
FROM `categorias`
SELECT *
FROM `etiqueta`
SELECT *
FROM `autores`
SELECT `libros`.*, `categorias`.`nombreCategoria`, `etiqueta`.`nombre` as `nombreEtiqueta`, `autores`.`nombreAutor`
FROM `libros`
JOIN `categorias` ON `categorias`.`idCategoria` = `libros`.`idCategoria`
JOIN `etiqueta` ON `etiqueta`.`idEtiqueta` = `libros`.`etiquetaLibro`
JOIN `autores` ON `autores`.`idAutor` = `libros`.`idAutor`

    function editar_libro($id=null) {
        $libro_Model = new libros_model();
        $categoria = new categorias_model();
        $etiquetas = new etiqueta_model();
        $autor = new autores_model();

        $data['categorias'] = $categoria->findAll();
        $data['etiquetas'] = $etiquetas->findAll();
        $data['autores'] = $autor->findAll();
        $data['libro'] = $libro_Model->where('idLibro', $id)->first();
---
SELECT *
FROM `categorias`
SELECT *
FROM `etiqueta`
SELECT *
FROM `autores`
SELECT *
FROM `libros`
WHERE `idLibro` = '16'
 LIMIT 1

    public function buscar_admin() {
        $filtro_por = $this->request->getGet('filtro_por');
        $busqueda = $this->request->getGet('busqueda');
        $libroModel = new libros_model();

        // Traemos los modelos necesarios para los labels de la vista
        $categoriaModel = new categorias_model();
        $etiquetas = new etiqueta_model();
        $data['categorias'] = $categoriaModel->findAll();
        $data['etiquetas'] = $etiquetas->findAll();

        $builder = $libroModel->select('libros.*, categorias.nombreCategoria, etiqueta.nombre as nombreEtiqueta, autores.nombreAutor')
            ->join('categorias', 'categorias.idCategoria = libros.idCategoria')
            ->join('etiqueta', 'etiqueta.idEtiqueta = libros.etiquetaLibro')
            ->join('autores', 'autores.idAutor = libros.idAutor');

        // Filtro estricto
        if (!empty($filtro_por) && !empty($busqueda)) {
            if ($filtro_por == 'nombre') {
                $builder->like('libros.nombreLibro', $busqueda);
            } elseif ($filtro_por == 'autor') {
                $builder->like('autores.nombreAutor', $busqueda);
            } elseif ($filtro_por == 'genero') {
                $builder->like('categorias.nombreCategoria', $busqueda);
            }
        }

        $data['libro'] = $builder->findAll();
---
SELECT *
FROM `categorias`
SELECT *
FROM `etiqueta`
SELECT `libros`.*, `categorias`.`nombreCategoria`, `etiqueta`.`nombre` as `nombreEtiqueta`, `autores`.`nombreAutor`
FROM `libros`
JOIN `categorias` ON `categorias`.`idCategoria` = `libros`.`idCategoria`
JOIN `etiqueta` ON `etiqueta`.`idEtiqueta` = `libros`.`etiquetaLibro`
JOIN `autores` ON `autores`.`idAutor` = `libros`.`idAutor`
WHERE `libros`.`nombreLibro` LIKE '%hikomi%' ESCAPE '!'