proyecto_bys_cardozo/app/Controllers/VentaController.php

SELECT *
FROM `venta`
WHERE `venta`.`idVenta` = 24
---
    public function cambiar_estado(int $idVenta, string $nuevoEstado): RedirectResponse {
        if (!session('login') || session('perfil') != 1) {
            return redirect()->to(base_url('login'))->with('error_login', 'Acceso no autorizado.');
        }

        $venta = $this->ventaModel->find($idVenta);

UPDATE `venta` SET `estado` = 'Finalizado'
WHERE `venta`.`idVenta` IN (24)
---
            $db->transBegin();

            // 3. Actualizar el registro string en la base de datos
            $this->ventaModel->update($idVenta, ['estado' => $nuevoEstado]);

SELECT *
FROM `venta`
JOIN `persona` ON `persona`.`idPersona` = `venta`.`idCliente`
JOIN `formapago` ON `formapago`.`idPago` = `venta`.`idPago`
LEFT JOIN `direccion` ON `direccion`.`idDireccion` = `persona`.`idDireccion`
LEFT JOIN `localidades` ON `localidades`.`idLocalidad` = `direccion`.`idLocalidad`
LEFT JOIN `provincias` ON `provincias`.`idProvincia` = `localidades`.`idProvincia`
WHERE `venta`.`estado` = 'Finalizado'
ORDER BY `venta`.`idVenta` DESC
---
            $estadoNuevoObj->ejecutarAccionPostTransicion($venta, $cliente);

            $db->transCommit();
            return redirect()->route('gestionar_ventas')->with('mensaje', 'El pedido #' . $idVenta . ' cambió a ' . $nuevoEstado . ' con éxito.');